["Empty-headed homunculous.","Pusilanimous pinhead.","Shut your talk-hole, bookah. Every time you open it, you drip stupid all over my floor.","Yo mamma’s so dumb, she thought a golemancer was what you get when you ask a golem question.","You're so fat, you got 100% world completion as soon as you logged in.","Yo mamma’s IQ so low she thinks crafting is something you do at a criver.","Who taught you to swim? Was it a rock? Quaggan thinks it must have been a rock.","Yo momma's so fat, it costs 100g to waypoint her.","You're duller than my alt's first sword.","You're so boring that I thought you were someone's clone.","Your mother was a Skritt, and your father stank of Omnomberries.","You're dumb. You'll die and you'll leave a dumb corpse.","Grenth was born as a half-god, son of Goddess Dwayna and a human sculptor (presumed to be Malchor). He ascended to full godhood after sealing the previous God of Death, Dhuum","Male Charrs have a lion-like tail and Female Charrs have a leopard-like tail","The Risen Giganticus Lupicus in Arah is much smaller than the actual race. The developer had to downscale it for combat visual purposes","Queen Jennah is a mesmer. And a powerful one, at that","Rata Sum is an anagram of “Mursaat”, an extinct ancient spellcaster race from the Isles of Janthir. Both races are believed to be interconnected","The Mesmer’s portal skill sound effect is the Guild Wars theme played backwards","Near the farms at the southeastern section of Ebonhawke there are several chickens which may be attacked but cannot die. Each chicken attacked will result in 3 hostile Angry Chickens, which have a high armor rating along the lines of a Champion","Sylvari are omnivorous. They can eat meat as well as plants. Also, they regenerate at the same rate as humans, forming a bark-like tissue on the injured spot instead of scar tissue. Their blood is a sticky golden sap","Asura typically live 5% – 10% longer than humans, with 120 years being an exceptional lifespan for an asura","Physical traits that are considered attractive among Asura are: wide foreheads (probably alludes to brain size) and large ears","Golem is an abbreviation for Genius Operated Living Enchanted Manifestation","Asura male names end with a consonant, whereas the female names end with a vowel","The schools of magic were born from four pieces of the blood stone cast to a volcano in the Ring of Fire; each representing Preservation (Guardian-related magic), Destruction (Elementalist-related magic), Aggression (Necromancer-related magic) and Denial (Mesmer and Thief-related magic)","One animal sign is missing from the Zodiac weapon set: the Ox. Instead the Zodiac Shield depicts a crescent moon, which is not a part of the Chinese Zodiac signs. The Zodiac weapon set is based on a set of weapons from the first game","Guild Wars 2 uses the Mouvelian calendar system (much similar to the gregorian Calendar), which begins at the time of the Exodus of the Gods. AE is short for After the Exodus. There are 4 seasons (Zephyr, Phoenix, Scion and Colossus) and 365 days in a Mouvelian year. Guild Wars 2 is set at 1327 AE","Tyria is both the name of a continent and the planet. The planet is believed to be over 11,000 years old. The globe which depicts the planet can be seen in the Order of Whisper’s Headquarters","The Order of Whispers is the oldest order among the three multiracial Orders of Tyria: Vigil, Whispers and Durmand Priory, the second being Durmand Priory and the newest being Vigil","There are 439 dyes available in the game","There’s a secret turkey room in AC Explorable path. There’s also a mysterious torch under the stairs that trigger a hidden ghost event","The “running-while-being-chased-by-large-boulder” part in the grawl fractal is a reference to the Indiana Jones franchise. There’s a pile of bones with his famous fedora hat nearby","Ranger pets can see and attack an enemy even while they’re invisible if the enemy attacks its master, provided that it’s set on aggressive behavior","Miyani, the Mystic Forge merchant, is a member of Order of the Sunspears, the order led by Kormir, a human who eventually ascended to godhood. She brought the djinn Zommoros, who resides in the Mystic Forge, with her when she fled from Elona","If 3 or more rangers use Call of the Wild a Lunar Wolf is summoned","Humans use surnames like most current humans do, to identify family","Asura don't use surnames, but might identify themselves as the college they went to. This is a way to say that they consider education and personal achievements above the ones of family members","Sylvari also tend not to use second names, but isn't really frowned either if one wanted to. Also, some sylvari identify themselves by saying whether they are firstborn (if they are) or by saying 'of the XXX cycle' after their name","Norn use surnames, and they represent family ties, but they usually single out a specific famous member and aren't the same for all the family members (I.E.: Braham Eirsson, Eir Stegalkin), but they can change them depending on personal achievements (Knut Whitebear, Borje the Sun Chaser)","Charr use surnames, but they depict a warband instead of family (actually, Charr consider their warband to be their real family). When a Charr is born, their parents give it a name, then once he's old enough to stand up they're send to live to the fahrar where they're assigned a warband. Then the warband members grow up together, learning to work and fight as a single unit. Each warband has a name, and each member is given a surname containing the warband name and something that reflect their personality. For example, Rytlock Brimstone is member (and current leader) of the Stone warband. Rox was a member of the Pick warband (a mining group) where she was known as Rox Pickheart. When her warband died in a cave in, leaving her as the sole survivor, she became a gladium (Charr with no warband), changing her name to who cares this is a lot of shit about Charr names.","The Sylvan Hounds are also born of the Pale Tree, making them sort-of cousins to the Sylvari. However, the hounds are born as pups and grow up, whereas the Sylvari are born as adults","I wrote a song. The chorus is:\nRah rah ah-ah-ah!\nArah ro-mah-mah\nZhaitan ooh-la-la!\nWant your light armor set.","Yo momma's so fat, the Jotun worship her as an artifact of their ancient kings.","Yo momma's so ugly, the Risen don't consider her an enemy.","Yo momma's so hairy that Ascalonians attack her on sight.","Yo momma eats so much her condition damage is boosted by 200% of her vitality."]