["I love how you just wear anything!",
"I wish I could go out with my hair unbrushed",
"Somehow that smell just works for you",
"I wish I could do fashion on a budget like you do.",
"Are you dating Riker? Good for you, scoring someone out of your league",
"Can I borrow your shoes? They're just so much more broken in and comfy than mine.",
"OMG I love your make up, you can't even see that scar.",
"Wow you must have great hearing with those ears.",
"You look like a Kardashian.",
"I like you because I’m not intimidated by you. Well, not that I think men should be intimidated by women anyway.",
"Out of all my friends with whom I could have said I had the worst sex in the world last night, I’m glad it was you.",
"You don’t look like that much of a boy with your hair that short.",
"The extra curve actually works on you.",
"I’m glad you’re not one of those girls that thinks she needs to lose weight. You don’t want to be skinny anyway.",
"See? Who said big girls can't be pretty!",
"You’re the whole package! You’re funny, talented, smart... I mean, if you were only skinnier you’d be absolutely perfect.",
"You’re not like obese, you’re like… skinny-fat.",
"This dress is way too big on me, so I think it will look really great on you!",
"You can dance really well for a fat girl.",
"Wow, you really get pretty when you lose weight!",
"Hey, let me know if you ever want help losing weight!",
"You’d look healthier if you lost 20 pounds.",
"You should dye your hair brunette. Your blonde hair really doesn’t make you look as intelligent as you actually are.",
"Well, you look really pretty when you put on some mascara and dress nice.",
"You’re much better looking in person than in pictures.",
"You grew into your head.",
"You got prettier in college.",
"This isn’t really your photo, is it? Thank God you blossomed. You should get your picture retaken.",
"You’re still pretty even though you have a big nose.",
"It must be so nice to have such small boobs.",
"You kind of look like you’re 13. But that’ll come in handy when you’re old!",
"You’re very detail-oriented but since you have issues with flexibility you’ll need a job where you basically do the same thing every day.",
"You’re a lot smarter than I thought!",
"It must be great to be an only child. You’re so used to being alone.",
"I wish I could be more like you and just not *care* you know?",
"You’re so much nicer and smarter than what people say about you.",
"You’re talented? But you’re in a sorority!",
"I can't belive your boyfriend left you.",
"You're smarter than you look.",
"I love how you don't care what you look like",
"You look so good! I almost didn't recognize you.",
"I didn't recognize you! You look beautiful!",
"I wish I had cute, tiny boobs like yours.",
"I love that outfit! You're so brave.",
"I wish I was as good at Algebra as you. But between student council and date night with Riker, I just can't find the time to study!",
"You're so confident when you sing, it's great! I guess I'm just too worried about staying in key.",
"Oh, I wish I could go to karaoke night with you, but it's always so tough at those things with my perfect pitch.",
"I love that you don't just do whatever's popular. Like, who cares if anyone likes you, right?",
"You're *so* brave for playing a Charr.",
"I love your anti-Meta builds. Who cares about damage numbers, we're playing to have *fun* aren't we?",
"Noone's counting achievement points anyway.",
"You and Logan Thackery are so great together. It must be nice having someone to you can talk to on your own level.",
"Do all Sylvari have that moist-leaves-smell? It's so exotic!",
"That armor set looks so great! I didn't realize you had any other skins!",
"I mean, your wardrobe is a testament to the fact that you can do a ton with just common dyes",
"It must be so easy to keep track of your characters when you have a free account.",
"I'm jealous. Now that I have Sunrise, I just don't get to play around with greatsword skins like you do.",
"So revenants get their powers from ancient legends? Is that why you dress in that old-fashioned armor?",
"You make Thief look like such a fun class; I just don't know that I could play a profession that's also a kind of criminal."]